Autodesk.Revit.DB.Structure.TrussMemberType
Indicates the "kind" of a truss member.

Autodesk.Revit.DB.Structure.TrussMemberType.ETK_TrussDiagWeb
Truss DiagWeb.

Autodesk.Revit.DB.Structure.TrussMemberType.ETK_TrussVertWeb
Truss VertWeb.

Autodesk.Revit.DB.Structure.TrussMemberType.ETK_TrussBottomChord
Truss bottom chord.

Autodesk.Revit.DB.Structure.TrussMemberType.ETK_TrussTopChord
Truss top chord.

Autodesk.Revit.DB.Structure.TrussMemberType.ETK_Unknown
Unknown element type.